package 확률_POCU;
// 판정문제 : YES/OR 답이 있는 질문
// 1.어떤 검사를 정해준 수 만큼 수행
// 2.한번 검사할 때 마다 검사 대상을 무작위로 뽑음
// 3.한번 검사할 때마다 둘 중 하나의 답이 나옴
// yes or no or unknown
//정해진 수만큼 검사뒤에도 여전히 모르겠음  -> No라고 결정


//예시1 : 품질관리
//가구 제조업체
//엄청 큰 통나무를 받아와서 그걸로 1000개의 의자를 만 듦
//그런데 실제 판매해 보니 교체해줘야 하는 의자가 평균 100개
//이유는 원목 강도가 기준에 미달하여 부서지는 상황
//방법1:모든의자를 일일이 다 검사함
//방법2:통나무가 기준미달인지 검사 -> 해당통나무로 38개의
//의자를 만들어서 문제 없으면 98%확률로 문제없음


//예시2 ; 소수판정(Primality test)
//방법1 : 대상 수 N에 대하여 N-1까지 나눠봄
//방법2 : 대상 수 N에 대하여 루트N까지 나눠봄
//방법3 : 밀러 라빈 소수판별법(몬테카를로)
//->


public class 확률08_확률적알고리즘_몬테카를로 {
    public static void main(String[] args){

    }
}
